InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ДокументУстановкиЦены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыИндивидуальные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыИндивидуальные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыЦен</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ПорядокОкругленияСтоимостиПроизводимыхПотолков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОкруглятьВБольшуюСторонуСтоимостьПроизводимыхПотолков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылочныйВидЦены</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатуры</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНаПродукцию</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНаУслугиПроизводства</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценкиОтБП1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры/Ext/ManagerModule.bsl
Функция ПолучитьЦенуНоменклатурыВВалютеУчета(Знач ДатаЦены, Знач ВидЦены, 
											Знач Номенклатура, Знач ХарактеристикаНоменклатуры = Неопределено, 
											Знач ЕдиницаИзмерения,
											Знач Контрагент = Неопределено, Знач ДоговорКонтрагента = Неопределено) Экспорт
											
	Валюта = ПолучитьФункциональнуюОпцию("ВалютаУчета");										
	Возврат ПолучитьЦенуНоменклатурыВВалюте(ДатаЦены, ВидЦены, 
											Номенклатура, ХарактеристикаНоменклатуры, 
											ЕдиницаИзмерения, Валюта,
	                                    	Контрагент,  ДоговорКонтрагента);	
КонецФункции

Функция ПолучитьЦенуНоменклатурыВВалюте(Знач ДатаЦены, Знач ВидЦены, 
										Знач Номенклатура, Знач ХарактеристикаНоменклатуры = Неопределено, 
										Знач ЕдиницаИзмерения, Знач Валюта,
	                                    Знач Контрагент = Неопределено, Знач ДоговорКонтрагента = Неопределено) Экспорт
	
	Если ХарактеристикаНоменклатуры = Неопределено Тогда
		ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	Если Контрагент = Неопределено Тогда
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	Если ДоговорКонтрагента = Неопределено Тогда
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;

	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаЦены,
	//++#7256
	|			ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(&ВидЦены КАК Справочник.ВидыЦен).СсылочныйВидЦены = ИСТИНА
	|						ТОГДА ВидЦены = ВЫРАЗИТЬ(&ВидЦены КАК Справочник.ВидыЦен).ВидЦеныНоменклатуры
	|					ИНАЧЕ ВидЦены = &ВидЦены
	|				КОНЕЦ
	//|			ВидЦен = &ВидЦены
	//--#7256
	|				И ЕдиницаИзмерения = &ЕдиницаИзмерения
	|				И Номенклатура = &Номенклатура
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|				И Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЦены",КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("ВидЦены",ВидЦены);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Валюта",Валюта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Цена;
	КонецЦикла;
	
	Результат = ПолучитьИндивидуальнуюЦенуНоменклатуры(Результат, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения,
											ДатаЦены, Валюта, Контрагент, ДоговорКонтрагента);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры = Неопределено, ЕдиницаИзмерения = Неопределено,
								Знач ДатаЦены, ВидЦены, Знач ВалютаДокумента,
								Знач Контрагент = Неопределено, Знач ДоговорКонтрагента = Неопределено) Экспорт
	
	Если ХарактеристикаНоменклатуры = Неопределено Тогда
		ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Если ЕдиницаИзмерения = Неопределено Тогда
		ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Номенклатура);
	КонецЕсли;
	Если ДатаЦены = Дата(1,1,1) Тогда
		ДатаЦены = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Контрагент = Неопределено Тогда
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	Если ДоговорКонтрагента = Неопределено Тогда
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ЦенаНоменклатуры = ПолучитьЦенуНоменклатурыВВалюте(КонецДня(ДатаЦены), ВидЦены, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ВалютаДокумента, Контрагент, ДоговорКонтрагента);
	
	Если НЕ ЦенаНоменклатуры = 0 Тогда
		Возврат ЦенаНоменклатуры;
	КонецЕсли;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	ОсновнаяВалютаПересчетаЦены = Константы.ОсновнаяВалютаПересчетаЦены.Получить();
	
	//++ №12971 комментируем
	//Если (ВалютаДокумента = ВалютаУчета)
	//	и (НЕ ВалютаДокумента = ОсновнаяВалютаПересчетаЦены) Тогда
	//	//пробуем получить цену по основной валюте пересчета цен, если валюта документа = валюта учета
	//	ЦенаНоменклатуры = ПолучитьЦенуНоменклатурыВВалюте(КонецДня(ДатаЦены), ВидЦены, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ОсновнаяВалютаПересчетаЦены, Контрагент, ДоговорКонтрагента);
	//	Если НЕ ЦенаНоменклатуры = 0 Тогда
	//		ДатаКурса = ДатаЦены;
	//		Если ДатаКурса = Дата(1,1,1) Тогда
	//			ДатаКурса = ТекущаяДатаСеанса();
	//		КонецЕсли;
	//		Результат = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ОсновнаяВалютаПересчетаЦены, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
	//	КонецЕсли;
	//Иначе
	//	//пробуем получить цену из прайса валюты учета и пересчитать по курсу документаНоменклатуры
	//	ЦенаНоменклатуры = ПолучитьЦенуНоменклатурыВВалютеУчета(КонецДня(ДатаЦены), ВидЦены, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Контрагент, ДоговорКонтрагента);
	//	ДатаКурса = ДатаЦены;
	//	Если ДатаКурса = Дата(1,1,1) Тогда
	//		ДатаКурса = ТекущаяДатаСеанса();
	//	КонецЕсли;
	//	Результат = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
	//КонецЕсли;
	//-- №12971 комментируем
	
	//++ №12971 по новому
	// 1. Если не нашли цену по валюте документа и задана валюта пересчета, ищем прайс в валюте пересчета
	//	(если нашли, то ставим цену в валюте документа по курсу к валюте пересчета)
	Если ЗначениеЗаполнено(ОсновнаяВалютаПересчетаЦены) Тогда
		
		ЦенаНоменклатуры = ПолучитьЦенуНоменклатурыВВалюте(КонецДня(ДатаЦены), ВидЦены, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ОсновнаяВалютаПересчетаЦены, Контрагент, ДоговорКонтрагента);
		
		Если НЕ ЦенаНоменклатуры = 0 Тогда
			
			ДатаКурса = ДатаЦены;
			
			Если ДатаКурса = Дата(1,1,1) Тогда
				ДатаКурса = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Возврат РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ОсновнаяВалютаПересчетаЦены, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// 2. Если не нашли цену по валюте пересчета, то ищем прайс в валюте учета (если валюта документа отличается от валюты учёта)
	//	(если нашли, то ставим цену в валюте документа по курсу к валюте учета)
	Если НЕ ВалютаДокумента = ВалютаУчета Тогда
		
		ЦенаНоменклатуры = ПолучитьЦенуНоменклатурыВВалютеУчета(КонецДня(ДатаЦены), ВидЦены, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Контрагент, ДоговорКонтрагента);
		
		Если НЕ ЦенаНоменклатуры = 0 Тогда
			
			ДатаКурса = ДатаЦены;
			
			Если ДатаКурса = Дата(1,1,1) Тогда
				ДатаКурса = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Возврат РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
			
		КонецЕсли;
		
	КонецЕсли;
	//-- №12971 по новому
	
	Возврат ЦенаНоменклатуры;
	
КонецФункции

Функция ПолучитьИндивидуальнуюЦенуНоменклатуры(ТекущаяЦена, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения,
											ДатаЦены, Валюта,
											Знач Контрагент, Знач ДоговорКонтрагента)
	Результат = ТекущаяЦена;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|			ТОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.Цена
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) + ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / 100 * ЦеныНоменклатурыИндивидуальныеСрезПоследних.Наценка КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК Цена,
		|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Отменена КАК Отменена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыИндивидуальные.СрезПоследних(
		|			&ДатаЦены,
		|			Контрагент = &Контрагент
		|				И ДоговорКонтрагента = &ДоговорКонтрагента
		|				И ЕдиницаИзмерения = &ЕдиницаИзмерения
		|				И Номенклатура = &Номенклатура
		|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|				И Валюта = &Валюта) КАК ЦеныНоменклатурыИндивидуальныеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&ДатаЦены,
		|				Номенклатура = &Номенклатура
		|					И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|					И Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
		|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения
		|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены";
		
		Запрос.УстановитьПараметр("ДатаЦены",КонецДня(ДатаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("Валюта",Валюта);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если НЕ Выборка.Отменена Тогда
				Результат = Выборка.Цена;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
